[
    {
        "userId": "u101",
        "gigId": "g001",
        "sellerId": "u001",
        "rating": 3,
        "text": "Late answers and recieved it late but better then most services.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u001",
        "gigId": "g002",
        "sellerId": "u002",
        "rating": 4,
        "text": "Excellent logs and photos mrs Jane, however they arrived late.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u001",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 5,
        "text": "I couldn't be happier with the logo Alice designed for my business. It perfectly captures the essence of my brand, and the attention to detail is outstanding. Alice was a pleasure to work with, and I highly recommend her services!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 4,
        "text": "Alice delivered a fantastic logo for my startup. The design process was smooth, and Alice was responsive to my feedback. The end result exceeded my expectations. I'll definitely return for future design needs.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 5,
        "text": "Alice is a true creative genius! Her logo design for my project was nothing short of exceptional. The concepts she presented were innovative, and she was patient and accommodating throughout the revision process. I'm thrilled with the final result.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u104",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 5,
        "text": "Working with Alice was a great experience. She took my vague ideas and turned them into a stunning logo that represents my brand perfectly. While there were minor hiccups along the way, the end product speaks for itself. I'm a satisfied customer.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u105",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 5,
        "text": "Alice's logo design skills are top-notch. She was receptive to my vision and incorporated my ideas seamlessly into the final product. The communication was excellent, and I appreciate the effort she put into my project.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u001",
        "gigId": "g102",
        "sellerId": "u102",
        "rating": 4,
        "text": "Ella's templates are top-notch. I purchased a template for my online store, and it has significantly improved the look and feel of my website. She was responsive to my customization requests, and I'm very satisfied with the result.",
        "createdAt": 1697456859373
    },
    {
        "userId": "u002",
        "gigId": "g102",
        "sellerId": "u102",
        "rating": 5,
        "text": "I needed a fresh look for my blog, and Ella's templates caught my eye. She delivered a beautiful template that perfectly matches my brand. Her design skills are impressive, and I highly recommend her work.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u101",
        "gigId": "g102",
        "sellerId": "u102",
        "rating": 4,
        "text": "Working with Ella was a good experience overall. Her templates are visually appealing, and she provided timely updates. While there were a few minor issues with responsiveness, she addressed them promptly.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u001",
        "gigId": "g103",
        "sellerId": "u103",
        "rating": 3,
        "text": "David delivered well-researched articles that fit my niche. They were informative and SEO-friendly. However, there were some minor grammar issues that needed editing.",
        "createdAt": 1697456859373
    },
    {
        "userId": "u002",
        "gigId": "g103",
        "sellerId": "u103",
        "rating": 4,
        "text": "I hired David to write articles for my blog, and he did a commendable job. The content was engaging, and he met the deadline. I appreciate his effort and will consider working with him again.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u101",
        "gigId": "g103",
        "sellerId": "u103",
        "rating": 4,
        "text": "While David's articles were decent, there were a few factual inaccuracies that needed correction. Communication was also somewhat delayed. Overall, the service was satisfactory.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g104",
        "sellerId": "u104",
        "rating": 5,
        "text": "Sophia composed the most beautiful song for our wedding day. It was incredibly touching and brought tears to our eyes. She captured our love story perfectly, and we couldn't be happier!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g104",
        "sellerId": "u104",
        "rating": 5,
        "text": "We hired Sophia to create a song for our anniversary celebration, and it was a hit! The melody and lyrics were exquisite. Sophia's talent shines through in her work, and we highly recommend her.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g104",
        "sellerId": "u104",
        "rating": 4,
        "text": "Sophia's songwriting skills are impressive. She composed a theme song for our corporate event that left a lasting impression on our guests. However, there were minor delays in delivery.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g105",
        "sellerId": "u105",
        "rating": 5,
        "text": "Lucas's 3D animations are nothing short of incredible. He turned our marketing video into a visual masterpiece that wowed our audience. The attention to detail is remarkable, and we'll definitely work with him again.",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g105",
        "sellerId": "u105",
        "rating": 5,
        "text": "I commissioned Lucas to create a custom 3D animation for my art project, and the results exceeded my expectations. His creativity and technical skills are impressive. A great collaborator!",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g105",
        "sellerId": "u105",
        "rating": 4,
        "text": "Lucas did an excellent job with our product presentation animation. It helped us showcase our product's features effectively. While there were minor delays, the quality made up for it.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g106",
        "sellerId": "u106",
        "rating": 5,
        "text": "Olivia provided invaluable legal guidance for my startup. Her deep knowledge of business law helped us navigate complex contracts. Her responsiveness and clarity made the process smooth.",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g106",
        "sellerId": "u106",
        "rating": 5,
        "text": "I hired Olivia for legal consultation, and I'm impressed by her expertise. She helped me understand the legal aspects of my business, and her advice was practical and actionable.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g106",
        "sellerId": "u106",
        "rating": 5,
        "text": "Olivia's legal services were a game-changer for our company. She assisted us in resolving a complex legal matter efficiently. Her professionalism and dedication were commendable.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g107",
        "sellerId": "u107",
        "rating": 5,
        "text": "Sophie's business coaching has been a transformative experience for me. She's an excellent listener, and her guidance helped me set and achieve meaningful goals in my life. Highly recommended!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g107",
        "sellerId": "u107",
        "rating": 5,
        "text": "I've been working with Sophie for business development, and I'm impressed by her expertise. Her coaching has helped me overcome obstacles and gain clarity on my life path.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g107",
        "sellerId": "u107",
        "rating": 5,
        "text": "Sophie's business coaching services have been invaluable. Her approach is practical and results-driven. She helped me achieve my goals and develop a more positive mindset.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g108",
        "sellerId": "u108",
        "rating": 5,
        "text": "Max's personalized workout plans have transformed my fitness journey. His expertise and attention to detail are evident in every plan. I've seen incredible results!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g108",
        "sellerId": "u108",
        "rating": 5,
        "text": "I reached out to Max to help me with weight loss, and I couldn't be happier. His plans are challenging yet achievable. He's been a motivating force in my fitness transformation.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g108",
        "sellerId": "u108",
        "rating": 4,
        "text": "Max's workout plans are effective, and he provides great support throughout the journey. While there were minor delays in communication, the results were worth it.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g109",
        "sellerId": "u109",
        "rating": 5,
        "text": "Ava's handcrafted candles are a true work of art. The scents are delightful, and the craftsmanship is exceptional. They make for a perfect relaxation companion.",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g109",
        "sellerId": "u109",
        "rating": 5,
        "text": "I purchased Ava's candles as gifts, and they were a hit! The recipients loved the unique scents and packaging. Ava's dedication to her craft shines through in every candle.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g109",
        "sellerId": "u109",
        "rating": 5,
        "text": "Ava's artisanal candles are a must-try. They add a special touch to any room. While there were slight delays in delivery, the quality of the candles exceeded my expectations.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g110",
        "sellerId": "u110",
        "rating": 5,
        "text": "Evelyn's digital avatars are a game-changer for my content. They capture my personality perfectly and have become a signature of my brand. Highly recommended!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g110",
        "sellerId": "u110",
        "rating": 5,
        "text": "I commissioned Evelyn for gaming avatars, and I'm impressed by her creativity. The avatars are visually appealing and unique. She's a talented artist.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g110",
        "sellerId": "u110",
        "rating": 5,
        "text": "Evelyn's avatars have enhanced my social media presence. Her communication and delivery were prompt. She's a professional in the digital art world.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g111",
        "sellerId": "u111",
        "rating": 5,
        "text": "Luna's fantasy novels are a masterpiece. Her storytelling transports you to another world. I couldn't put the book down until I finished it. A true literary talent!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g111",
        "sellerId": "u111",
        "rating": 5,
        "text": "I commissioned Luna to write a fantasy novel, and I was captivated from the first page. Her writing style is enchanting, and her world-building is exceptional. A must-read!",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g111",
        "sellerId": "u111",
        "rating": 5,
        "text": "Luna's fantasy novels are a treasure. Her attention to detail and character development make her books a joy to read. While the delivery was a bit delayed, the quality made up for it.",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g112",
        "sellerId": "u112",
        "rating": 5,
        "text": "Alex's VR tours are a historical enthusiast's dream. It feels like you're really there in the past. The attention to detail and knowledge shared during the tour are remarkable.",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g112",
        "sellerId": "u112",
        "rating": 4,
        "text": "I took Alex's virtual tour of historical landmarks, and it was an incredible experience. The interactivity and storytelling make history come alive. Highly recommended!",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g112",
        "sellerId": "u112",
        "rating": 5,
        "text": "Alex's VR tours are a unique way to explore history. Although there was a slight delay in communication, the tours themselves are worth every penny. I learned so much!",
        "createdAt": 1697457303713
    },
    {
        "userId": "u101",
        "gigId": "g113",
        "sellerId": "u113",
        "rating": 1,
        "text": "I hired GamerGuffaw for video game help, and it was a disaster. Their 'assistance' led to hilarious but utterly chaotic gameplay. I couldn't stop laughing, but my character kept dying!",
        "createdAt": 1697456859373
    },
    {
        "userId": "u102",
        "gigId": "g113",
        "sellerId": "u113",
        "rating": 5,
        "text": "If you want a gaming experience that's completely absurd and sidesplitting, GamerGuffaw is your guy! Their 'help' turned my gaming session into a comedy night with friends.",
        "createdAt": 1697456859393
    },
    {
        "userId": "u103",
        "gigId": "g113",
        "sellerId": "u113",
        "rating": 2,
        "text": "GamerGuffaw's 'assistance' is a disaster in the best way possible. It's so bad that it's good. My character glitched into walls, and I laughed so hard I cried. A must-try for a good time!",
        "createdAt": 1697457303713
    },
    {
        "userId": "u112",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 5,
        "text": "The logs we got from Alice were amazing!",
        "createdAt": 1697494314442
    },
    {
        "userId": "u111",
        "gigId": "g101",
        "sellerId": "u101",
        "rating": 4,
        "text": "While the product I recieved was fine, I expected higher quality.",
        "createdAt": 1697494430594
    },
    {
        "userId": "u110",
        "gigId": "g001",
        "sellerId": "u001",
        "rating": 3,
        "text": "The seller did not deliver the product on time. Although the photos were nice, it was not worth the wait.",
        "createdAt": 1697530329899
    },
    {
        "userId": "u103",
        "gigId": "g001",
        "sellerId": "u001",
        "rating": 5,
        "text": "amazing pictures oh high quality, would order again.",
        "createdAt": 1697629480818
    },
    {
        "userId": "u107",
        "gigId": "g001",
        "sellerId": "u001",
        "rating": 4,
        "text": "excellent service but bad timing, can't blame because of timezones.",
        "createdAt": 1697975430953
    },
    {
        "userId": "u106",
        "gigId": "g002",
        "sellerId": "u002",
        "rating": 4,
        "text": "She answered immediately, it did arrive a bit late.",
        "createdAt": 1698311592503
    }
]